<?php

namespace Dfer\Tools\Statics;

/**
 * +----------------------------------------------------------------------
 * | 静态调用
 * +----------------------------------------------------------------------
 *                                            ...     .............
 *                                          ..   .:!o&*&&&&&ooooo&; .
 *                                        ..  .!*%*o!;.
 *                                      ..  !*%*!.      ...
 *                                     .  ;$$!.   .....
 *                          ........... .*#&   ...
 *                                     :$$: ...
 *                          .;;;;;;;:::#%      ...
 *                        . *@ooooo&&&#@***&&;.   .
 *                        . *@       .@%.::;&%$*!. . .
 *          ................!@;......$@:      :@@$.
 *                          .@!   ..!@&.:::::::*@@*.:..............
 *        . :!!!!!!!!!!ooooo&@$*%%%*#@&*&&&&&&&*@@$&&&oooooooooooo.
 *        . :!!!!!!!!;;!;;:::@#;::.;@*         *@@o
 *                           @$    &@!.....  .*@@&................
 *          ................:@* .  ##.     .o#@%;
 *                        . &@%..:;@$:;!o&*$#*;  ..
 *                        . ;@@#$$$@#**&o!;:   ..
 *                           :;:: !@;        ..
 *                               ;@*........
 *                       ....   !@* ..
 *                 ......    .!%$! ..        | AUTHOR: dfer
 *         ......        .;o*%*!  .          | EMAIL: df_business@qq.com
 *                .:;;o&***o;.   .           | QQ: 3504725309
 *        .;;!o&****&&o;:.    ..
 * +----------------------------------------------------------------------
 *
 */
class Files extends Base
{
    //um单个文件上传
    const UPLOAD_UMEDITOR_SINGLE = 0;
    //um编辑框
    const UPLOAD_UMEDITOR_EDITOR = 1;
    //layui编辑器上传
    const UPLOAD_LAYUI_EDITOR = 2;
    //editormd编辑器上传
    const UPLOAD_EDITORMD_EDITOR = 3;
    //baidu组件上传
    const UPLOAD_WEB_UPLOADER = 4;

	protected function originClass($var = null){
		$class = str_replace("\Statics", "", __CLASS__);
		return new $class;
	}
}
