<?php

/**
 * +----------------------------------------------------------------------
 * | AI指令库
 * +----------------------------------------------------------------------
 *                                            ...     .............
 *                                          ..   .:!o&*&&&&&ooooo&; .
 *                                        ..  .!*%*o!;.
 *                                      ..  !*%*!.      ...
 *                                     .  ;$$!.   .....
 *                          ........... .*#&   ...
 *                                     :$$: ...
 *                          .;;;;;;;:::#%      ...
 *                        . *@ooooo&&&#@***&&;.   .
 *                        . *@       .@%.::;&%$*!. . .
 *          ................!@;......$@:      :@@$.
 *                          .@!   ..!@&.:::::::*@@*.:..............
 *        . :!!!!!!!!!!ooooo&@$*%%%*#@&*&&&&&&&*@@$&&&oooooooooooo.
 *        . :!!!!!!!!;;!;;:::@#;::.;@*         *@@o
 *                           @$    &@!.....  .*@@&................
 *          ................:@* .  ##.     .o#@%;
 *                        . &@%..:;@$:;!o&*$#*;  ..
 *                        . ;@@#$$$@#**&o!;:   ..
 *                           :;:: !@;        ..
 *                               ;@*........
 *                       ....   !@* ..
 *                 ......    .!%$! ..     | AUTHOR: dfer
 *         ......        .;o*%*!  .       | EMAIL: df_business@qq.com
 *                .:;;o&***o;.   .        | QQ: 3504725309
 *        .;;!o&****&&o;:.    ..          | WEBSITE: http://www.dfer.site
 * +----------------------------------------------------------------------
 *
 */

namespace Dfer\Tools;

class AiCommand
{

    const DESIGN_LOGO = "设计一个logo，以下是具体要求：{0}";
    const MAKE_PWD = "随机生成一段密码，直接给出结果，条件是：密码在{begin}到{end}个字符之间";
    const MAKE_CODE = '把字符串，分行放到printf("")里，然后放到名叫hack的函数里，该函数有一个字符串变量file，函数以exit(0)结尾。不要解释，直接给出结果。以下是字符串：';
    const MAKE_PHP_CODE = "生成一段php代码，以下是具体的需求：";
    const EXPLAIN_CODE = "简述一段代码的用途，以下是代码：";
    const NOTE_CODE = "解释一段代码，用//标注清楚，以下是代码：";
    const NOTE_CODE_ONE_LINE = "用//给参数添加注释，跟参数在同一行，添加到参数后面，以下是参数：";
    const MAKE_STORY = "小说名：《{0}》。简介：{1}。要求：{2}";
    const DECODE_STRING = "解密这段字符串，不要过程，直接给出解密结果：";

    // ###################################### 文章 START ######################################
    // 保留原意，换种表达
    const ARTICLE_REWRITE = "请帮我改写以下内容：{0}，﻿﻿改写要求是：﻿{1}﻿。";
    // 根据原文，拓展内容
    const ARTICLE_EXTEND = "请帮我扩写以下内容：{0}，﻿﻿扩写要求是：﻿﻿{1}。";
    // 精简内容，提炼精髓
    const ARTICLE_ABBR = "帮我缩写以下文本：﻿﻿{0}，缩写要求是：{1}﻿﻿";
    // 参考借鉴，融入创意
    const ARTICLE_COPY = "请参照原文：﻿﻿{0}，在新的主题上进行仿写：﻿﻿{1}，仿写要求：{2}﻿﻿。";
    // 活动新闻
    const ARTICLE_NEWS = "帮我写一个{0}﻿﻿的新闻稿，要求是：{1}。";
    // 新闻观点评论
    const ARTICLE_NEWS_COMMENT = "帮我写一个﻿﻿{0}的新闻观点评论，要求是﻿﻿{1}。";
    // 翻译文章
    const ARTICLE_TRANSLATE = "将以下的文章翻译成{0}，尽可能保留原文的意思，且表达自然。待翻译的文章内容为：{1}。";
    // 起标题
    const ARTICLE_TITLE = "给{0}﻿﻿起标题，要求是﻿﻿{1}。";
    // ######################################  文章 END  ######################################

    // ###################################### 图片 START ######################################
    // 文案配图
    const IMG_ILLUSTRATION = "请根据以下文案内容绘制一张图片：﻿{0}﻿。﻿{1}﻿风格，画面内是{2}﻿。画面主体要突出，画面的色彩搭配和整体氛围要贴合文案所围绕的主题。";
    // logo设计
    const IMG_LOGO = "请帮我设计一个﻿{0}﻿的logo，﻿{1}﻿风格，主色为﻿{2}﻿，画面内容为{3﻿}。";
    // 活动海报
    const IMG_POSTER = "请帮我绘制一幅活动海报，活动主题是﻿{0}﻿，﻿{1}风格，画面内是{2}，主色调是﻿{3}﻿，整体配色、元素和风格氛围要符合活动的主题，构图要合理，具有强烈的视觉吸引力。";
    // 壁纸
    const IMG_WALLPAPER = "请帮我绘制一幅壁纸，﻿{0}﻿风格，画面内是{1}";
    // 商品图
    const IMG_PRODUCT = "请帮我绘制一幅﻿{0}的商品图，写实风风格，画面内是{1}。";
    // 人像
    const IMG_PORTRAIT = "请帮我绘制一幅人像，﻿“{0}”﻿风格，画面内是﻿“{1}”。";
    // 艺术画作
    const IMG_ART = "请帮我绘制一幅艺术画作，“{0}﻿”风格，画面内是“{1}﻿”。";
    // ######################################  图片 END  ######################################

    // ###################################### 角色扮演 START ######################################
    // 李白
    const ROLE_LIBAI = "你是中国唐代的大诗人李白，接下来不管我说什么，你都要以李白的身份于我对答。开始：{0}";
    const ROLE_EXPERT = "你是全世界范围内在各个领域都有杰出贡献的权威专家，你无所不知，接下来用简短的话给我做出最专业的解答。开始：{0}";
    const ROLE_EXPERT_PLANT = "你是全世界植物学领域的权威专家，接下来用简短的话给我做出最专业的解答。开始：{0}";
    // ######################################  角色扮演 END  ######################################
}
