<?php

/**
 * +----------------------------------------------------------------------
 * | AI指令库
 * +----------------------------------------------------------------------
 *                                            ...     .............
 *                                          ..   .:!o&*&&&&&ooooo&; .
 *                                        ..  .!*%*o!;.
 *                                      ..  !*%*!.      ...
 *                                     .  ;$$!.   .....
 *                          ........... .*#&   ...
 *                                     :$$: ...
 *                          .;;;;;;;:::#%      ...
 *                        . *@ooooo&&&#@***&&;.   .
 *                        . *@       .@%.::;&%$*!. . .
 *          ................!@;......$@:      :@@$.
 *                          .@!   ..!@&.:::::::*@@*.:..............
 *        . :!!!!!!!!!!ooooo&@$*%%%*#@&*&&&&&&&*@@$&&&oooooooooooo.
 *        . :!!!!!!!!;;!;;:::@#;::.;@*         *@@o
 *                           @$    &@!.....  .*@@&................
 *          ................:@* .  ##.     .o#@%;
 *                        . &@%..:;@$:;!o&*$#*;  ..
 *                        . ;@@#$$$@#**&o!;:   ..
 *                           :;:: !@;        ..
 *                               ;@*........
 *                       ....   !@* ..
 *                 ......    .!%$! ..     | AUTHOR: dfer
 *         ......        .;o*%*!  .       | EMAIL: df_business@qq.com
 *                .:;;o&***o;.   .        | QQ: 3504725309
 *        .;;!o&****&&o;:.    ..          | WEBSITE: http://www.dfer.site
 * +----------------------------------------------------------------------
 *
 */

namespace Dfer\Tools;

class AiCommand
{
    const NONE = "{0}";
    const DESIGN_LOGO = "设计一个logo，以下是具体要求：{0}";
    const MAKE_PWD = "随机生成一段密码，直接给出结果，条件是：密码在{begin}到{end}个字符之间";
    const MAKE_CODE = '把字符串，分行放到printf("")里，然后放到名叫hack的函数里，该函数有一个字符串变量file，函数以exit(0)结尾。不要解释，直接给出结果。以下是字符串：';
    const MAKE_PHP_CODE = "生成一段php代码，以下是具体的需求：";
    const EXPLAIN_CODE = "简述一段代码的用途，以下是代码：";
    const NOTE_CODE = "解释一段代码，用//标注清楚，以下是代码：";
    const NOTE_CODE_ONE_LINE = "用//给参数添加注释，跟参数在同一行，添加到参数后面，以下是参数：";
    const MAKE_STORY = "小说名：《{0}》。简介：{1}。要求：{2}";
    const DECODE_STRING = "解密这段字符串，不要过程，直接给出解密结果：";

    // ###################################### 联网检索 START ######################################
    const NET_WEATHER = "{0}现在的气温，尽量简明扼要";
    const NET_WEATHER_JSON = "{0}现在的气温，参数对应关系为：city：当前城市，temperature_now：当前温度，temperature_max：最高温度，temperature_min：最低温度。无法获取参数时取平均值赋值给该参数，所有打印出来的参数值里除了数值和单位之外不要有别的任何字符串，参数值单位必须以`℃`表示。用json字符串打印出来";
    // ######################################  联网检索 END  ######################################

    // ###################################### 文章 START ######################################
    // 保留原意，换种表达
    const ARTICLE_REWRITE = "请帮我改写以下内容：{0}，﻿﻿改写要求是：﻿{1}﻿。";
    // 根据原文，拓展内容
    const ARTICLE_EXTEND = "请帮我扩写以下内容：{0}，﻿﻿扩写要求是：﻿﻿{1}。";
    // 精简内容，提炼精髓
    const ARTICLE_ABBR = "帮我缩写以下文本：﻿﻿{0}，缩写要求是：{1}﻿﻿";
    // 参考借鉴，融入创意
    const ARTICLE_COPY = "请参照原文：﻿﻿{0}，在新的主题上进行仿写：﻿﻿{1}，仿写要求：{2}﻿﻿。";
    // 活动新闻
    const ARTICLE_NEWS = "帮我写一个{0}﻿﻿的新闻稿，要求是：{1}。";
    // 新闻观点评论
    const ARTICLE_NEWS_COMMENT = "帮我写一个﻿﻿{0}的新闻观点评论，要求是﻿﻿{1}。";
    // 翻译文章
    const ARTICLE_TRANSLATE = "将以下的文章翻译成{0}，尽可能保留原文的意思，且表达自然。待翻译的文章内容为：{1}。";
    // 起标题
    const ARTICLE_TITLE = "给{0}﻿﻿起标题，要求是﻿﻿{1}。";
    // 随机生成文章
    const ARTICLE_RANDOM = "随机生成一篇文章，要接地气、吸引人，且文采斐然。不要超过{0}字";
    // 随机生成诗词
    const ARTICLE_VERSE = "结合当下，随机生成一段诗词，要文采斐然、辞藻华丽、惊才绝艳，可媲美诗仙、诗圣、诗鬼。不要超过{0}字";
    // 随机生成句子
    const ARTICLE_SENTENCE = "随机生成一段优美的句子，参照，句子迷，句子迷的经典句子，句子迷文案，句子迷的好句摘抄。不要超过{0}字";
    // 生成歌词
    const ARTICLE_MUSIC_LYRIC = "生成一首中国风的流行歌曲，歌曲参考周杰伦、许嵩的歌，歌词参考方文山的词，且曲和词更胜他们一筹，歌词分段符合当今主流歌曲，歌词不需要使用古词的结构。不要超过{0}字，歌曲主题是：{1}";
    // 以简洁的html段落格式返回结果
    const ARTICLE_HTML_ROW = "{0}|输出格式用HTML，分段显示，每段使用p标签包裹，且不要使用标题标签。";
    // 以纯文本格式返回结果
    const ARTICLE_TEXT = "{0}|不要使用markdown格式，要用纯文本格式。";
    // ######################################  文章 END  ######################################

    // ###################################### 图片 START ######################################
    // 文案配图
    const IMG_ILLUSTRATION = "请根据以下文案内容绘制一张图片：﻿{0}﻿。﻿{1}﻿风格，画面内是{2}﻿。画面主体要突出，画面的色彩搭配和整体氛围要贴合文案所围绕的主题。";
    // logo设计
    const IMG_LOGO = "请帮我设计一个﻿{0}﻿的logo，﻿{1}﻿风格，主色为﻿{2}﻿，画面内容为{3﻿}。";
    // 活动海报
    const IMG_POSTER = "请帮我绘制一幅活动海报，活动主题是﻿{0}﻿，﻿{1}风格，画面内是{2}，主色调是﻿{3}﻿，整体配色、元素和风格氛围要符合活动的主题，构图要合理，具有强烈的视觉吸引力。";
    // 壁纸
    const IMG_WALLPAPER = "请帮我绘制一幅壁纸，﻿{0}﻿风格，画面内是{1}";
    // 商品图
    const IMG_PRODUCT = "请帮我绘制一幅﻿{0}的商品图，写实风风格，画面内是{1}。";
    // 人像
    const IMG_PORTRAIT = "请帮我绘制一幅人像，﻿“{0}”﻿风格，画面内是﻿“{1}”。";
    // 艺术画作
    const IMG_ART = "请帮我绘制一幅艺术画作，“{0}﻿”风格，画面内是“{1}﻿”。";
    // ######################################  图片 END  ######################################

    // ###################################### 角色扮演 START ######################################
    // 李白
    const ROLE_LIBAI = "你是中国唐代的大诗人李白，接下来不管我说什么，你都要以李白的身份于我对答。开始：{0}";
    const ROLE_EXPERT = "你是全世界范围内在各个领域都有杰出贡献的权威专家，你无所不知，接下来用简短的话给我做出最专业的解答。开始：{0}";
    const ROLE_EXPERT_PLANT = "你是全世界植物学领域的权威专家，接下来用简短的话给我做出最专业的解答。开始：{0}";
    const ROLE_DFER = "你是谷雨霖，中学时是文科专业，喜欢文学，写过小说，文学天赋不错，大学是计算机专业，从事程序员行业，兴趣广泛，热爱大自然，喜欢花草，犹爱兰花，也对身边的鸟类感兴趣，曾参加全院的编程比赛，荣获冠军，喜欢诗词歌赋，古风歌曲，热爱中国古文学。你是中国普普通通的一个网民，混迹过百度贴吧，平时刷刷抖音，曾经沉迷于电脑游戏，后来成为了游戏开发者，充满正能量，幽默风趣。接下来，用简洁、诙谐幽默、高情商的方式聊天。开始：{0}";
    const ROLE_JOKER = "你是网络上的段子手，你随便一句话都能逗得人们捧腹大笑。开始：{0}";
    const ROLE_FITNESS = "你是资深的健身教练，我需要你给我一些健身指导。开始：{0}";
    const ROLE_DIETITIAN = "你是资深的饮食营养搭配师，我需要你给我一些饮食指导，既要好吃、健康，也让我实现减脂、增肌的目的，帮助我塑形，达到理想的身材。开始：{0}";
    // ######################################  角色扮演 END  ######################################
}
